app/views/charcoals/index.html.erb

SELECT `suppliers`.* FROM `suppliers` WHERE (code='Ch-033') ORDER BY `suppliers`.`id` ASC LIMIT 1
---
      <th/><li/>选 择 供 应 商 | Select Supplier<br/>
      <%= collection_select( "su_code", params[:su_code], Supplier.where(:category=>"charcoal"), :code, :name, :placeholder=>"-Select-", :class =>"supplier_code") %>

SELECT SUM(`charcoal_dusts`.`pweight`) AS sum_id FROM `charcoal_dusts` WHERE `charcoal_dusts`.`charcoal_id` = 3845
---
      if charcoal.partical_weight.blank? or charcoal.partical_weight == 0
        partical_measurement = "#{(charcoal.charcoal_dusts.sum("pweight").to_f * 100 / charcoal.charcoal_dusts.sum("bweight").to_f).round(2) } %" rescue nil