app/views/ms_loadings/_loading_summary_search.html.erb


        <td><%= collection_select(params[:destination], "destination", Destination.all(:order=>"name").collect {|d| d.name }, :to_s, :humanize, :prompt => "All") %></td>
---
SELECT `destinations`.* FROM `destinations` ORDER BY name


        <td><%= collection_select(params[:grade], "grade", Grade.all(:order=>"name"), :name, :name, :prompt => "All") %></td>
---
SELECT `grades`.* FROM `grades` ORDER BY name