app/views/ms_loadings/index.html.erb


      <% @po_info=PoControl.where("po_no = ?", ms_loading.po ).first %>
      <% if ms_loading.po_index.nil? or ms_loading.po_index.blank? then @po_count = MsShippment.where("po=?", ms_loading.po).count else @po_count = MsShippment.where("po=?", ms_loading.po+'-'+ms_loading.po_index).count end %>
---
SELECT `po_controls`.* FROM `po_controls` WHERE (po_no = '4010110') ORDER BY `po_controls`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `ms_shippments` WHERE (po='4010110')


      <% @pay_check = Payment.where("invoice=?", ms_loading.invoice).all %>
---
SELECT `payments`.* FROM `payments` WHERE (invoice='EM140225-02')