app/views/site/_ms_report.html.erb

SELECT `grades`.* FROM `grades` WHERE `grades`.`product` = 'microsilica'
---

  <li/> 产 品 | Product: <%= collection_select(params[:p_spec], "p_spec", Grade.where(:product=>"microsilica"), :name, :name, :prompt => "ALL", :class =>"product_spec") %>