app/views/site/_period_search.html.erb


  <p/><li/> 等 級 | Grade: <%= collection_select(params[:grade], "grade", Grade.all, :name, :name, :prompt => "All Grades", :class =>"grade") %>
---
SELECT `grades`.* FROM `grades`