app/controllers/charcoals_controller.rb

  def index


    @charcoals = Charcoal.paginate :page => params[:page], :order => 'form_code DESC',:per_page => 40
---
SELECT COUNT(*) FROM `charcoals`
SELECT `charcoals`.* FROM `charcoals` ORDER BY form_code DESC LIMIT 40 OFFSET 40

  def show

    @charcoal = Charcoal.find(params[:id])

    if @charcoal.partical_weight.nil?

      @test_method="Warehouse"
      @partical_measurement = "Operating"

    else

      if @charcoal.partical_weight == 0 and @charcoal.charcoal_dusts.count == 0

        @test_method="Not Test"
        @partical_measurement = ""

      elsif @charcoal.partical_weight > 0

        @test_method="Fully Test"
        @partical_measurement = "#{@charcoal.partical_weight} Kg"

      else

        @test_method="Sampling Test"
        @partical_measurement = "#{(@charcoal.charcoal_dusts.sum("pweight").to_f * 100 / @charcoal.charcoal_dusts.sum("bweight").to_f).round(2) } %" rescue nil

      end
    end


    @supplier = Supplier.where( "code=?", @charcoal.su_code ).first
---
SELECT `charcoals`.* FROM `charcoals` WHERE `charcoals`.`id` = 3831 LIMIT 1
SELECT `charcoal_dusts`.* FROM `charcoal_dusts` WHERE `charcoal_dusts`.`charcoal_id` = 3831
SELECT `suppliers`.* FROM `suppliers` WHERE (code='Ch-063') ORDER BY `suppliers`.`id` ASC LIMIT 1