app/controllers/env_monitors_controller.rb

SELECT COUNT(*) FROM `env_monitors`
SELECT `env_monitors`.* FROM `env_monitors` ORDER BY created_at DESC, furnace LIMIT 144 OFFSET 0
---
  def index
    @env_monitors = EnvMonitor.paginate :page => params[:page],  :order => 'created_at DESC, furnace', :per_page => 144

SELECT `env_monitors`.* FROM `env_monitors` WHERE `env_monitors`.`id` = 49937 LIMIT 1
---
  def show
    @env_monitor = EnvMonitor.find(params[:id])

INSERT INTO `env_monitors` (`ac_p`, `bc_p`, `c_in_t`, `created_at`, `furnace`, `in_c`, `m_bearing1`, `m_bearing2`, `m_current`, `m_speed`, `m_stator`, `o_bearing1`, `o_bearing2`, `o_current`, `o_t`, `operator`, `p_airtank`, `rs_bearing1`, `rs_bearing2`, `rs_current`, `updated_at`) VALUES ('559', '997', '0', '2014-03-24 10:02:40', '2', '189', '0', '46', '501', '650', '99.3', '0', '39', '160', '0', 'ben', '0.62', '46', '0', '160', '2014-03-24 10:02:40')
---
  def create
    params.permit!
    @env_monitor = EnvMonitor.new(params[:env_monitor])

    respond_to do |format|
      if @env_monitor.save