app/controllers/ms_loadings_controller.rb

  def index
    @ms_loadings = MsLoading.paginate :page => params[:page], :order => 'date DESC',:per_page => 40
---
SELECT COUNT(*) FROM `ms_loadings`
SELECT `ms_loadings`.* FROM `ms_loadings` ORDER BY date DESC LIMIT 40 OFFSET 0