app/controllers/ms_shippments_controller.rb

SELECT COUNT(*) FROM `ms_shippments`
SELECT `ms_shippments`.* FROM `ms_shippments` ORDER BY date DESC, po, gpo LIMIT 30 OFFSET 0
---
  def index
    @ms_shippments = MsShippment.paginate :page => params[:page], :order => 'date DESC, po, gpo', :per_page => 30