app/controllers/reports_controller.rb

  def daily


    @quartz_rate=RmRate.where(:code=>"quartz").first.rate.to_i
    @charcoal_rate=RmRate.where(:code=>"charcoal").first.rate.to_i
    @wood_rate=RmRate.where(:code=>"wood").first.rate.to_i
    @coke_rate=RmRate.where(:code=>"coke").first.rate.to_i

    # 生成生產日報表

    if params[:date]
      date = params[:date].to_date
      #sdate = Date.civil(params[:date][:"(1i)"].to_i,params[:date][:"(2i)"].to_i,params[:date][:"(3i)"].to_i)
      @silicons = Silicon.select("id, fe, al, ca, ti, p, b, furnace, grade, weight, shift, no, date, remark, t_point").where("date=?", date).order( 'furnace, date DESC, shift, no')
      @silicons_yesterday = Silicon.where("date=?", date.yesterday).order( 'furnace, date DESC, shift, no')
    end

    @date_select = date

    @expense = EFurnace.where("date=?", @date_select)

    @total_power=@expense.sum(:s1_e)+@expense.sum(:s2_e)+@expense.sum(:s3_e)
    @total_quartz=@expense.sum(:s1_q)+@expense.sum(:s2_q)+@expense.sum(:s3_q)
    @total_charcoal=@expense.sum(:s1_ch)+@expense.sum(:s2_ch)+@expense.sum(:s3_ch)
    @total_wood=@expense.sum(:s1_w)+@expense.sum(:s2_w)+@expense.sum(:s3_w)
---
SELECT `rm_rates`.* FROM `rm_rates` WHERE `rm_rates`.`code` = 'quartz' ORDER BY `rm_rates`.`id` ASC LIMIT 1
SELECT id, fe, al, ca, ti, p, b, furnace, grade, weight, shift, no, date, remark, t_point FROM `silicons` WHERE (date='2014-03-23') ORDER BY furnace, date DESC, shift, no
SELECT `e_furnaces`.* FROM `e_furnaces` WHERE (date='2014-03-23')
SELECT `silicons`.* FROM `silicons` WHERE (date='2014-03-22') ORDER BY furnace, date DESC, shift, no
SELECT SUM(`e_furnaces`.`s3_e`) AS sum_id FROM `e_furnaces` WHERE (date='2014-03-23')
SELECT SUM(`e_furnaces`.`s3_q`) AS sum_id FROM `e_furnaces` WHERE (date='2014-03-23')
SELECT SUM(`e_furnaces`.`s3_ch`) AS sum_id FROM `e_furnaces` WHERE (date='2014-03-23')
SELECT SUM(`e_furnaces`.`s3_w`) AS sum_id FROM `e_furnaces` WHERE (date='2014-03-23')

  def ms_report

    @grades = Grade.where(:product=>"microsilica")
    @normal = " 无异常 | Normal | ปกติ "

    # 某時間區間內的生產報表

    ############# 判 断 时 间 区 间 ############################
    if params[:ms_sdate] && params[:ms_edate]

      @start_date = params[:ms_sdate].to_date
      @end_date = params[:ms_edate].to_date

      @date_period = @start_date..@end_date

    end

    if params[:p_spec] == ""
      @p_spec = []
      @grades.each do |g|
---
SELECT `grades`.* FROM `grades` WHERE `grades`.`product` = 'microsilica'
SELECT `microsilicas`.* FROM `microsilicas`

    ##################参数检索###################
    @microsilica_all = Microsilica.all

    @production_confirmed = MsProdConfirm.where(:date=>@date_period)
---
SELECT `ms_prod_confirms`.* FROM `ms_prod_confirms` WHERE (`ms_prod_confirms`.`date` BETWEEN '2014-03-16' AND '2014-03-22')



    #根据条件所检索出的微硅粉生产记录
    @microsilicas = Microsilica.where(:date=>@date_confirmed, :silo => @silo, :density=>@density_period, :bsize=>@size, :m_type=>@p_spec ).order( 'silo, date DESC, bag DESC, m_type')
---
SELECT SUM(`microsilicas`.`bsize`) AS sum_id FROM `microsilicas` WHERE `microsilicas`.`date` IN ('2014-03-22') AND `microsilicas`.`m_type` IN ('920D', '945SD', '940U', 'Raw', '920D(S)', '940U(S)', '920ED') AND `microsilicas`.`bsize` = 500 AND `microsilicas`.`m_type` = '920D' AND (`microsilicas`.`silo` >= 0 AND `microsilicas`.`silo` < 100) AND (`microsilicas`.`density` BETWEEN 0.0 AND 10000.0) AND (`microsilicas`.`bsize` >= 1 AND `microsilicas`.`bsize` < 10000) AND (location IS NULL OR location = ' ' )
SELECT `microsilicas`.* FROM `microsilicas` WHERE `microsilicas`.`date` IN ('2014-03-16', '2014-03-17', '2014-03-18', '2014-03-19', '2014-03-20', '2014-03-21', '2014-03-22') AND `microsilicas`.`m_type` IN ('920D', '945SD', '940U', 'Raw', '920D(S)', '940U(S)', '920ED') AND (`microsilicas`.`silo` >= 0 AND `microsilicas`.`silo` < 100) AND (`microsilicas`.`density` BETWEEN 0.0 AND 10000.0) AND (`microsilicas`.`bsize` >= 1 AND `microsilicas`.`bsize` < 10000) AND (location IS NULL OR location = ' ' ) ORDER BY silo, date DESC, bag DESC, m_type


    @ms_shippments = MsShippment.where(:date=>@date_period)
    #所选择时间范围内微硅粉发货记录
    @msshipped_all = Msshipbag.joins( :msshiplot => :ms_shippment )
    @msshipped = Msshipbag.joins( :msshiplot => :ms_shippment ).where('ms_shippments.date >= ? and ms_shippments.date <= ?', @start_date, @end_date )

    @msshipped_po = @msshipped.group_by { |s|s.msshiplot.ms_shippment.po }.sort
---
SELECT SUM(msshiplots.bsize) AS sum_id FROM `msshipbags` INNER JOIN `msshiplots` ON `msshiplots`.`id` = `msshipbags`.`msshiplot_id` INNER JOIN `ms_shippments` ON `ms_shippments`.`id` = `msshiplots`.`ms_shippment_id` WHERE (ms_shippments.date >= '2014-03-22' and ms_shippments.date <= '2014-03-22') AND (msshiplots.spec = '920D' and msshiplots.bsize = 500)
SELECT `msshipbags`.* FROM `msshipbags` INNER JOIN `msshiplots` ON `msshiplots`.`id` = `msshipbags`.`msshiplot_id` INNER JOIN `ms_shippments` ON `ms_shippments`.`id` = `msshiplots`.`ms_shippment_id` WHERE (ms_shippments.date >= '2014-03-16' and ms_shippments.date <= '2014-03-22')
SELECT `msshiplots`.* FROM `msshiplots` WHERE `msshiplots`.`id` = 3158 ORDER BY `msshiplots`.`id` ASC LIMIT 1