app/controllers/silicons_controller.rb

SELECT COUNT(*) FROM `silicons`
SELECT `silicons`.* FROM `silicons` ORDER BY date DESC, furnace, shift, no LIMIT 50 OFFSET 0
---
  def index
    #    @topic = "Silicons' Quality Analysis"

    #    @silicons = Silicon.all :order => "date DESC"

    @silicons = Silicon.paginate :page => params[:page], :order => 'date DESC, furnace, shift, no', :per_page => 50