app/controllers/silos_controller.rb

SELECT COUNT(*) FROM `silos`
SELECT `silos`.* FROM `silos` ORDER BY created_at DESC, silo LIMIT 96 OFFSET 0
---
  def index

    @silo = Silo.new
    @silos = Silo.paginate :page => params[:page], :order => 'created_at DESC, silo', :per_page => 96

SELECT `silos`.* FROM `silos` WHERE `silos`.`id` = 75093 LIMIT 1
---
  def show
    @silo = Silo.find(params[:id])

INSERT INTO `silos` (`created_at`, `density`, `level`, `operator`, `packing`, `pressure`, `roots`, `silo`, `temperture`, `updated_at`) VALUES ('2014-03-24 10:03:00', '624', '5.81', 'ben', '0', '0', 22, '1', '0', '2014-03-24 10:03:00')
---
  def create
    params.permit!
    @silo = Silo.new(params[:silo])

    respond_to do |format|
      if @silo.save