app/controllers/site_controller.rb

SELECT date, fe, al, ca, furnace, grade, weight FROM `silicons` ORDER BY date DESC, furnace, shift DESC, no DESC LIMIT 1000
SELECT `security_cases`.* FROM `security_cases` ORDER BY datetime DESC LIMIT 6
---
  def index
    #show silicaon test result
    @silicons = Silicon.select("date, fe, al, ca, furnace, grade, weight").limit(1000).order("date DESC, furnace, shift DESC, no DESC")
    @furnace = @silicons.group_by { |a|a.furnace}

    #show safety cases
    @security_case = SecurityCase.all(:order => 'datetime DESC', :limit => 6)