app/views/reports/daily.html.erb

        <% total_weight_f_g = @furnace[furnace].collect(&:weight).sum.to_i rescue nil  %>
        <% packing_weight_f = @si_packing.where(:furnace=>furnace).sum("weight").to_i rescue nil %>
---
SELECT `e_furnaces`.* FROM `e_furnaces` WHERE (date='2014-03-23')