app/views/reports/ms_report.html.erb

              <% #if ms.date.to_date.cweek<10 then @week_no="0"+"#{ms.date.to_date.cweek}" else @week_no=ms.date.to_date.cweek end %>
              <% @rework_check = MsRework.where("lot=? and bag=?", 0.to_s+ms.silo.to_s+@week_no.to_s+ms.date.to_date.strftime("%y").to_s, ms.bag.to_s ).count %>
---
SELECT COUNT(*) FROM `ms_reworks` WHERE (lot='041214' and bag='27')